In [1]:
import numpy as np
import pandas as pd
from numpy import nan as NA

# 7.1處理遺失資料

* pandas使用了浮點數值NaN(Not a Number)來代表遺失資料 -> 稱為標記值

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

* Python內建的None也會被當成NA(R 語言中的not available)

In [5]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## NA處理方法
|參數|描述|
|:-:|:-:|
|dropna|以指定軸上的標籤為單位，過濾每個指定的標籤是否有遺失資料值，對於遺失資料的容忍有不同的限定值|
|fillna|將遺失資料已指定的值取代，或使用內插值方法如'ffill'或'bfill'|
|isnull|回傳布林值，指出目標是否為遺失值|
|notnull|isnull的反向函式|

## 過濾遺失值

* 對Series來說，dropna會回傳非遺失資料與他所屬的index

In [7]:
from numpy import nan as NA

In [4]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [3]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
# 等校於上面寫法
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

* 對DataFrame來說，dropna預設只要列裡有缺失值就會濾除該列

In [6]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

* 指定how='all'的話，只會濾除全部為NA的列

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

* 傳入axis=1 -> 改為對欄做一樣的效果

In [11]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

* 過濾DataFrame時常會需要考慮時間序列資料，可以使用thresh參數指定

In [14]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  1.026420  0.076882 -0.139649
1 -0.689907  0.360060  1.731116
2 -0.579787  1.162763 -0.002905
3  1.095541  1.235842  0.605998
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

In [16]:
df.iloc[:4, 1] = NA
df

          0         1         2
0  1.026420       NaN -0.139649
1 -0.689907       NaN  1.731116
2 -0.579787       NaN -0.002905
3  1.095541       NaN  0.605998
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

In [18]:
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.026420       NaN       NaN
1 -0.689907       NaN       NaN
2 -0.579787       NaN -0.002905
3  1.095541       NaN  0.605998
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

In [19]:
df.dropna()

          0         1         2
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

In [21]:
df.dropna(thresh=2)

          0         1         2
2 -0.579787       NaN -0.002905
3  1.095541       NaN  0.605998
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

## 為缺失值填值

* 可使用fillna將要用的常數取代值傳入

In [22]:
df.fillna(0)

          0         1         2
0  1.026420  0.000000  0.000000
1 -0.689907  0.000000  0.000000
2 -0.579787  0.000000 -0.002905
3  1.095541  0.000000  0.605998
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

* 可使用dict型態來指定不同欄填入不同值

In [32]:
df.fillna(value={1: 0.5, 2: 0})

          0         1         2
0  0.564240 -0.086700  1.693999
1 -1.534388  0.347715 -0.779250
2  1.019330  0.500000  1.590113
3  0.578254  0.500000 -0.857108
4  1.096050  0.500000  0.000000
5 -1.864860  0.500000  0.000000

* fillna執行完後，會傳回一個物件，也可以使用in-place來修改原資料

In [24]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.026420  0.000000  0.000000
1 -0.689907  0.000000  0.000000
2 -0.579787  0.000000 -0.002905
3  1.095541  0.000000  0.605998
4 -0.722519 -2.509582 -0.599268
5 -2.683757 -0.219150  1.014237
6 -0.233870 -0.306056  1.333987

* 重作索引中的內插法，在fillna中也可使用

In [25]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  0.564240 -0.086700  1.693999
1 -1.534388  0.347715 -0.779250
2  1.019330 -1.376318  1.590113
3  0.578254  2.259484 -0.857108
4  1.096050  0.104948  1.306140
5 -1.864860 -1.316316  0.372358

In [26]:
df.iloc[2:, 1] = NA
df

          0         1         2
0  0.564240 -0.086700  1.693999
1 -1.534388  0.347715 -0.779250
2  1.019330       NaN  1.590113
3  0.578254       NaN -0.857108
4  1.096050       NaN  1.306140
5 -1.864860       NaN  0.372358

In [27]:
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.564240 -0.086700  1.693999
1 -1.534388  0.347715 -0.779250
2  1.019330       NaN  1.590113
3  0.578254       NaN -0.857108
4  1.096050       NaN       NaN
5 -1.864860       NaN       NaN

In [28]:
df.fillna(method='ffill')

          0         1         2
0  0.564240 -0.086700  1.693999
1 -1.534388  0.347715 -0.779250
2  1.019330  0.347715  1.590113
3  0.578254  0.347715 -0.857108
4  1.096050  0.347715 -0.857108
5 -1.864860  0.347715 -0.857108

In [29]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.564240 -0.086700  1.693999
1 -1.534388  0.347715 -0.779250
2  1.019330  0.347715  1.590113
3  0.578254  0.347715 -0.857108
4  1.096050       NaN -0.857108
5 -1.864860       NaN -0.857108

* 可使用fillna將平均值或中位數傳到一個Series中

In [30]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [31]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## fillna函式參數
|參數|描述|
|:-:|:-:|
|value|用來填充缺失值的常數或類dict物件|
|method|內插的方法，如果函式沒有使用其他參數的話，預設是'ffill'|
|axis|要填充的軸向，預設為axis=0|
|inplace|直接修改呼叫的物件，不產出複製資料|
|limit|向前或向後填充時，最大的填充數|

## 7.2資料轉換

## 移除重複值

In [33]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

* DataFrame的duplicated方法會回傳一個布林Series，用來指出每個列有沒有重複值(與前面的列相比)

In [34]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

* drop_duplicates -> 直接回傳DataFrame，內容是duplicated中標示為False的資料

In [35]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

* 上面兩種方法都會對全部資料做檢查
* 可在duplicated內中放入欄名稱來進行部分檢查

In [37]:
# 增加新的一欄
data['v1'] = range(7)

In [38]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [40]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

* duplicated和drop_duplicates預設會保留第一個看到的重複值，若設定keep='last' -> 會保留使用最後一個重複值

In [42]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## 使用函示或對應關係轉換值

* 使用某些資料集合時，可能會需要使用某一欄的值，對於資料集合進行某種轉換

In [6]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 
                              'Pastrami', 'corned beef', 'Bacon', 
                              'pastrami', 'honey ham', 'nova lox'], 
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

* 接下來為這些肉品新增相對應的動物對照表

In [7]:
meat_to_animal = {'bacon': 'pig', 
                  'pulled pork': 'pig', 
                  'pastrami': 'cow', 
                  'corned beef': 'cow', 
                  'honey ham': 'pig', 
                  'nova lox': 'salmon'}

* 使用str.lower()將肉品名稱統一為小寫

In [8]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [9]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

* 只傳遞單一函數就可以完成所有工作的方法

In [11]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 取代值

In [12]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

* 使用pandas的replace函數將-999取代為NA值(除非指定in-place，不然會回傳一個新的Series)

In [13]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

* 如果需取代多個值，可以傳入一個list，後面再加上要替換的值

In [14]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

* 若是想對不同的目標值使用不同的替換值，也可以傳入替換值list

In [15]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

* 也可以使用dict型態傳入

In [16]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

* <font color=yellow>data.replace與data.str.replace不同，data.str.replace是做元素級的字串轉換</font>

## 更名軸index

* 與Series一樣，軸標籤也可以藉由函式或對應進行轉換，產出帶有新標籤的另一個新物件
* 你也可以in-place修改，不建立新的資料結構

In [18]:
data = pd.DataFrame(np.arange(12).reshape(3, 4), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

* 軸的index物件跟Series一樣，都有一個較map的方法

In [19]:
transform = lambda x: x[:4].upper()

In [20]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

* 可以對index給值，就是in-place修改同一個DataFrame物件

In [21]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

* 如果不想動到原來的東西，但想建立一個新轉換過的index的資料集合 -> 可以使用rename

In [22]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [23]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

* rename還可以搭配dict物件，取代部分軸標籤

In [24]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

* rename可以節省手動複製DataFrame和指定index和columns屬性的時間，若想in-place的修改一個資料集，就指定inplace=True

In [26]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## 離散化和分組

* 將連續性的資料作離散化或分組

In [2]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

* 將年紀分作18-25，26-35，36-60，61以上 -> 可使用pandas中的cut

In [3]:
bins = [18, 25, 35, 60, 100]
bins

[18, 25, 35, 60, 100]

In [4]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

* 此方法會回傳一個特殊的Categorical物件，代表pandas.cut計算完後的分組 -> 可以當作分組名稱字串的陣列，內部是個Categorical陣列，陣列內容是各個分組名稱及ages資料的index

* 可在codes屬性忠看到categorical陣列

In [5]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [7]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [8]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

* pd.value_counts(cats)顯示pandas.cut分組以後每組數量
* 小括號代表該端open，中括號代表closed -> 可以藉由指定right=False來改變包含的一端

In [9]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

* 還可以把分組取名，只要將名稱list或陣列指定給labels選項

In [10]:
groups_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
groups_names

['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [11]:
pd.cut(ages, bins, labels=groups_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

* 如果傳給cut的不是分組區間，而是分組組數的話 -> 會用資料中最小值與最大值中間計算等距分組

* 建立一個平均分布的資料

In [3]:
data = np.random.rand(20)
data

array([0.83707387, 0.49701675, 0.70091061, 0.73469336, 0.71070398,
       0.30453048, 0.47482564, 0.61955273, 0.344471  , 0.28167099,
       0.30145561, 0.60209981, 0.86814477, 0.39660581, 0.57094237,
       0.16216915, 0.14683486, 0.65271775, 0.27888129, 0.53089894])

* 將資料切為4組，且取到小數下第二位(precision)

In [4]:
pd.cut(data, 4, precision=2)

[(0.69, 0.87], (0.33, 0.51], (0.69, 0.87], (0.69, 0.87], (0.69, 0.87], ..., (0.15, 0.33], (0.15, 0.33], (0.51, 0.69], (0.15, 0.33], (0.51, 0.69]]
Length: 20
Categories (4, interval[float64, right]): [(0.15, 0.33] < (0.33, 0.51] < (0.51, 0.69] < (0.69, 0.87]]

* qcut函式 -> 依照樣本數量分組 -> cut會因為資料分布不同而造成每組資料數量也不同 -> qcut切完後每組數量會一致

In [5]:
data = np.random.randn(1000)  # 常態分布
data

array([ 1.08374645e+00,  5.42387120e-01,  1.52236549e+00, -1.40396917e+00,
        3.79497567e-01, -2.25949222e+00, -1.01892399e+00, -1.59679635e+00,
        2.14781866e-01, -2.56516172e-01, -2.32680828e-01,  6.19626881e-01,
        7.33911209e-01,  1.49500222e+00, -1.90249110e-01, -1.95227598e+00,
        9.72818052e-01,  9.84324588e-02, -7.90833359e-02,  1.41347757e+00,
       -2.99909322e+00, -1.45105877e+00,  6.68546453e-01, -5.12179921e-01,
       -1.32211587e+00,  6.74745301e-02, -1.12031380e-01, -2.48946678e-01,
        1.70259909e-01,  1.73775982e+00,  2.03801789e+00, -1.28442056e+00,
       -7.62959330e-01,  2.59737387e-01, -4.42380443e-01,  1.27777644e+00,
        3.76529974e-02,  1.60188609e-01, -1.58082065e+00,  4.14036096e-01,
       -7.96881061e-01, -6.72768773e-01, -1.50639746e+00,  5.96331895e-01,
       -1.12524321e+00,  3.62407201e-01, -8.23528013e-01,  1.57459941e+00,
        8.17973597e-01,  1.48218328e+00,  9.95256244e-01, -8.16666400e-01,
        5.64017176e-01, -1.48451456e+00,  1.13960697e+00,  3.27039555e+00,
       -5.45484735e-01,  9.44837545e-02, -3.77352885e-01,  3.21915951e-01,
        2.29477957e+00,  9.37611769e-01, -9.83124602e-02, -4.83910384e-01,
       -9.16462379e-01, -1.41670903e-01, -7.99110816e-01,  4.26818188e-01,
       -1.22224640e+00, -1.36925211e+00,  1.05892882e-01, -6.84707221e-02,
        2.19752135e-01,  8.29207280e-01, -7.04403261e-01,  1.79294935e-01,
        1.21142132e+00,  7.61277656e-01,  1.26771504e+00,  7.62256408e-01,
        9.03610204e-01,  1.94034143e-01, -6.88322480e-01, -6.76801769e-01,
       -1.80107222e+00, -2.61561555e-01, -1.12033858e+00,  5.14611696e-01,
        1.54631764e+00, -1.45224832e+00,  3.25078986e-01, -1.52839856e+00,
       -4.26422983e-01, -8.29987947e-01, -7.04372372e-01,  9.54976936e-01,
       -6.15745743e-02,  9.57315322e-01, -1.11973477e+00, -2.10031208e+00,
       -9.37969338e-02,  4.57459785e-01, -1.99113904e-01,  3.79788599e-01,
        6.08529791e-01, -1.51631202e+00, -1.10532976e+00,  4.82739405e-01,
       -8.87533074e-01,  1.30338093e-01,  4.19108293e-03,  1.25763423e+00,
       -6.58442755e-01,  3.90666171e-01,  1.85411894e-01,  5.23963091e-01,
        1.35593773e+00,  1.75860809e-01, -1.24237090e+00, -8.93202412e-02,
       -1.51234166e-01, -6.64785534e-02,  6.76151708e-01,  2.94457648e-01,
       -1.27352880e+00, -1.39365952e+00, -1.06385866e+00, -1.69756238e+00,
        1.34724657e+00,  1.23243402e+00, -3.38862575e-01, -1.47546019e-01,
       -2.13664780e+00, -3.91854434e-01,  2.41165116e+00,  4.77126231e-01,
        7.26737219e-01, -1.37429936e+00,  1.22374792e+00,  1.06621681e+00,
       -1.18692349e+00,  3.83086413e-01,  3.90529546e-01,  3.52494160e-01,
       -1.65237408e-01, -1.97090802e-01,  7.65769848e-01,  2.24079045e-02,
        1.07086299e+00, -4.66748794e-01, -6.47265310e-01, -5.34291278e-01,
        1.61633364e-01, -8.95280588e-01,  1.33421079e+00,  5.13430291e-01,
       -4.51975855e-01,  3.52284707e-02,  1.88294667e+00,  1.55374148e-01,
       -7.70226908e-01,  2.04238837e+00,  1.91472011e-01,  2.84927103e-01,
       -2.26852229e-01,  4.11817373e-01,  4.03667190e-01, -1.99001328e-01,
       -1.00708556e-01,  1.53983802e+00,  5.73525163e-01,  9.52778754e-02,
       -2.00354304e+00, -1.46501866e+00,  3.16955819e+00, -2.29282035e-01,
        9.32399630e-01, -1.31343404e+00,  5.59790126e-01,  2.00464532e+00,
        9.72087458e-02, -1.13760011e+00,  5.32671033e-01,  3.62816654e-03,
        9.03430716e-01,  1.14659721e-01,  1.11544721e+00, -8.32822209e-01,
        4.20267709e-02, -7.59618064e-01,  9.45171661e-01, -1.05846692e+00,
        1.51807915e-01, -2.02132861e+00,  7.08064351e-01, -8.20627830e-03,
       -8.58734560e-02,  2.67383345e-01, -1.96541563e-01, -1.08808829e+00,
       -2.67212105e-01, -3.97885904e-01,  8.21290701e-01,  1.59193869e+00,
        1.76488654e-01,  1.44950550e+00,  1.01912492e+00,  4.17984883e-01,
       -1.84748439e+00, -5.64846186e-01,  1.28030184e+00, -3.07168636e-01,
        1.03105810e+00,  8.36646031e-01,  1.04142841e+00,  5.95434707e-01,
        6.14082870e-01, -4.87948002e-01,  1.72904700e+00,  4.60606385e-01,
        7.79132062e-01, -6.82194107e-02,  5.75978442e-01, -8.45881653e-01,
       -2.41626442e-01, -5.07061615e-02,  2.26174055e+00, -2.93316370e-01,
        2.79153357e-01,  2.01963926e+00, -3.73475537e-02,  6.94069718e-01,
        3.41068311e-01, -8.78561035e-01, -9.39302498e-01,  5.59477050e-01,
        2.65656677e-01,  5.32003916e-01, -4.74843683e-02,  8.10866442e-01,
       -2.93288491e-01, -8.82496371e-01, -2.06124828e-01,  2.03341248e+00,
        6.53980156e-01, -7.90230334e-01,  2.59999304e+00, -1.22529419e+00,
        2.42771958e-01, -4.46461251e-01,  5.43946352e-01, -6.99741037e-01,
        1.39741171e+00, -6.22403044e-01,  1.10846150e+00,  5.31579376e-02,
       -1.44773097e+00, -8.11575342e-01,  2.69856257e-01, -1.19044821e+00,
       -2.75733710e+00, -1.29925233e+00, -4.99016819e-01, -1.78206787e+00,
       -3.48454300e-01,  1.23602062e+00,  3.70155176e-01, -8.26426560e-01,
        9.46950998e-02,  4.40394417e-01, -1.53019459e+00,  7.37026489e-01,
       -7.05319080e-01, -7.50028450e-02,  3.23450139e-01, -6.47830357e-01,
        6.77429578e-01, -2.13901604e-01,  4.33091791e-01,  7.00139422e-01,
        7.44486346e-01, -7.17975034e-01, -1.45389897e+00,  3.59961801e-01,
       -4.44465183e-01,  4.88319994e-01,  2.33041660e-01, -8.13805350e-01,
       -5.02258629e-01, -6.00591332e-01,  5.93635788e-01, -2.55007139e-01,
       -1.81702869e+00,  1.84649738e+00,  3.74002883e-01, -9.27575197e-01,
        1.28851370e+00,  1.56268545e+00,  5.89809729e-01, -1.41588269e+00,
        4.09630593e-01,  9.24685770e-01, -1.35406513e-01, -2.37690801e+00,
       -1.66920796e-01, -1.06006260e+00,  1.06595435e+00,  1.73437074e-01,
       -3.62348157e-01,  1.28186058e-01, -8.26843822e-01,  1.14695404e-01,
       -3.18223683e-01,  5.31116583e-02,  2.04335342e-01, -5.88435750e-02,
        5.84829101e-01, -3.49725867e-01, -1.25190091e+00,  1.36132204e-02,
       -8.04945791e-01, -2.20357430e+00, -1.44670132e+00, -1.17403844e+00,
       -1.41425682e+00, -2.39614820e-01,  1.16781676e+00,  1.67350922e-01,
       -7.89529878e-01,  1.83147650e+00, -1.25290452e-01, -1.76662450e+00,
       -3.20740729e-01,  7.79620880e-01,  1.66821446e+00, -4.00209180e-01,
        5.58067407e-01, -5.11639206e-01, -2.77639408e+00,  8.21035120e-01,
        5.16270512e-01,  6.55385877e-01, -2.03762776e+00, -2.31460199e-01,
       -3.04685557e-01,  9.92285624e-01, -7.29304613e-01, -9.90898242e-01,
       -4.86959171e-01, -5.74959018e-01,  2.54036089e-01, -2.07328247e-01,
       -6.49497223e-01,  1.20476901e+00, -7.76782343e-01,  5.76075151e-01,
        1.87247763e-01, -2.38941500e-01,  1.02669331e+00, -1.18089739e+00,
        9.96501166e-01,  2.70076236e-01,  2.82565808e-02,  2.90951875e-01,
        1.66026803e+00, -4.66819273e-01,  1.91125764e-01, -1.03003733e-01,
        1.09834348e+00,  7.66026564e-02,  1.05212761e+00, -5.28592846e-01,
        8.50228297e-02, -2.11739023e+00, -1.71942448e-01, -1.12862601e+00,
       -1.60292683e-01,  1.49427293e-01, -4.90334828e-01,  9.15291143e-01,
       -5.28972637e-01,  1.19051136e+00,  4.98264162e-01, -8.56372037e-01,
       -8.18771068e-01, -2.01323281e+00,  3.51746700e-01,  5.27031669e-01,
        8.63086923e-01, -2.04704508e-02, -1.12349064e+00,  2.25395494e+00,
        2.04844778e+00, -2.80230689e-01, -1.16964570e-01, -1.55533175e+00,
       -2.29193506e-01,  1.20655029e+00,  4.64532132e-01, -2.29220478e+00,
       -6.80782738e-01, -8.68215163e-01, -7.50194140e-01,  2.53466994e-01,
        2.05731910e+00, -6.78799292e-01,  1.11382665e+00, -2.28169134e-01,
       -1.83193249e-01,  1.49096248e+00,  5.94399288e-01, -2.62438404e-01,
        1.08158871e+00, -1.24000174e+00, -1.99611188e-01, -6.30974272e-01,
        1.26950352e+00,  3.16887521e-01,  3.43062667e-01,  2.11188632e+00,
       -1.63900302e+00, -1.80658095e-02, -1.42188165e-01, -1.29248520e+00,
       -1.18628458e+00, -2.18725554e-01,  1.43971726e+00, -1.65594491e+00,
        1.96137852e+00,  9.99233319e-01,  1.92925122e+00, -2.05316710e+00,
        2.38007594e+00,  1.22639333e+00,  1.46387339e+00,  1.29930870e+00,
        9.11812726e-01, -4.59621084e-01, -7.75741471e-01,  7.26626020e-01,
        4.83854578e-01,  5.10764109e-01, -1.10642937e+00,  5.57707097e-01,
        1.19564917e-01,  2.16711967e-01, -1.04286694e-01,  6.34032911e-01,
       -7.60767706e-01,  3.48833938e-01, -2.22702076e-01,  1.97054466e+00,
       -4.85257593e-01,  6.76418944e-01,  1.14949517e+00,  1.34332456e+00,
       -3.48895019e-01,  1.36188694e-01, -8.23625780e-01, -1.72255914e-01,
        1.08933014e+00,  6.66323560e-01,  4.30547532e-01,  1.77210997e+00,
       -4.59045348e-02, -2.10523273e+00, -2.52015523e-01, -1.15895488e+00,
        4.22035430e-01, -4.48605571e-01, -1.28188489e+00,  8.72009068e-02,
        1.67472536e+00, -7.50305525e-01, -8.59962268e-01,  1.86108533e+00,
        1.45335005e+00,  5.31790454e-02,  4.84150318e-01, -2.48164556e-01,
        3.39065530e-01,  8.20214022e-01,  2.73235544e-01, -3.51683217e-01,
        8.76041323e-01, -5.99259191e-01, -4.25075754e-01, -9.20048600e-01,
        1.53323144e+00, -9.09563188e-01, -3.81464756e-01, -3.82838330e-01,
       -7.60838456e-01, -2.01787422e+00,  4.99434785e-01,  8.46608829e-01,
       -1.21734015e+00, -2.87450675e-01, -1.70674896e+00,  7.62879675e-01,
        1.65934030e-01,  3.15360351e-01,  1.70620167e-01,  2.49826768e-01,
        2.20516734e-01, -1.32150568e+00,  9.13388681e-01, -1.64420103e+00,
        2.25293164e-01,  3.08767420e-01,  6.11693620e-01, -8.23869154e-01,
       -3.46194638e-02, -1.02677020e-01, -1.57050560e-01,  3.98423389e-01,
        1.76347444e-01, -2.33174226e+00,  1.41406393e-01, -4.03744746e-01,
        2.91243252e-01, -1.61104796e+00,  1.14080518e+00,  1.04561107e+00,
        1.68333893e+00,  3.35423430e-01,  5.79259670e-02, -5.89822498e-01,
       -1.25585612e+00,  5.26893470e-01,  9.14154810e-01, -9.95390264e-01,
       -2.06869976e-01,  1.99289659e+00,  1.86142247e+00,  5.74796763e-01,
       -8.93564299e-01, -5.27610556e-02, -6.36092671e-01, -8.63984224e-01,
        3.60383658e-01,  5.62390907e-01, -2.30770953e-01,  1.08320174e+00,
        5.29954802e-02, -4.49265271e-01,  6.63468772e-01,  1.16229428e+00,
        1.13475055e+00,  5.25153863e-01, -3.37800515e-01,  5.48729047e-01,
       -1.22211974e-01,  2.82729380e+00,  7.88842188e-01, -1.01775592e+00,
        1.75685154e+00,  1.03273513e+00, -2.25434612e-01, -1.68133068e-01,
       -5.95965473e-01,  8.00492215e-01,  9.80363935e-01,  7.90364760e-02,
        6.74101673e-01,  1.64288003e+00,  8.32408810e-01,  8.55335287e-02,
        6.13281050e-01, -7.02312371e-01,  1.32805652e-01, -2.68102694e+00,
       -3.14614640e-01, -2.25537686e+00,  6.44748550e-01,  1.10111439e+00,
       -7.88951163e-01,  1.13946724e+00,  1.85982437e+00, -2.95194598e+00,
        1.51363792e+00, -2.42284135e+00,  6.02861774e-01, -2.37381565e+00,
       -1.20254981e+00, -6.94987968e-01,  1.02707673e+00, -2.13686026e-01,
       -7.55305966e-01, -1.04536544e-02, -2.13637958e+00, -8.10213692e-02,
       -8.81370405e-01,  6.21384830e-01, -5.36072919e-02,  1.26025660e+00,
        2.71249999e-03, -9.86805471e-01, -9.19495685e-01,  2.01809517e-01,
        2.13381046e-01,  7.38671572e-01,  5.33693346e-01, -8.85822251e-01,
        8.01931191e-01, -5.80507792e-01,  1.11543380e+00,  2.32768174e+00,
       -4.71738664e-01,  3.64969317e-01, -1.52185944e-01,  1.10454093e+00,
        6.08153292e-01, -2.14252817e+00,  8.66696127e-01, -3.09330943e-01,
        1.26850821e-01, -1.84608446e+00, -1.33906726e+00, -9.74472810e-02,
       -1.56212520e+00, -5.80095082e-01,  2.37645064e-01,  2.48909374e-01,
        4.49192814e-01,  1.56050930e-01, -1.01155353e+00,  9.40155120e-02,
       -3.88730791e-01, -1.12757625e+00, -8.30032298e-01, -3.96915433e-01,
       -1.03244810e+00,  4.48646568e-01,  1.23648612e+00,  6.82003328e-01,
        2.83383607e-01, -6.02439293e-01, -4.08951673e-01, -2.16918376e-01,
        1.13400304e+00, -2.69529565e+00,  1.11737674e+00,  9.49569985e-01,
       -3.65690371e-01,  1.43958854e+00,  5.36888544e-01, -3.98855561e-01,
       -1.56592135e+00,  1.61862615e+00, -1.94244828e+00,  8.32656142e-01,
       -1.44664952e+00,  2.74906563e+00,  5.92398259e-01, -1.36545472e+00,
        1.66310254e-01,  2.61744254e-01,  4.04076956e-01, -1.89860656e+00,
       -1.15252095e+00, -7.46401794e-02, -8.36227247e-01, -8.49168749e-01,
        8.30995032e-01, -9.67716425e-01, -1.24065343e+00,  3.20912981e-01,
       -1.34058041e+00, -2.80521901e-01,  2.59303282e-01,  1.80169547e+00,
        1.26048003e+00,  5.97142294e-01, -1.09340285e-01,  1.08377431e+00,
        1.13418117e+00,  3.95354505e-01,  1.55612096e-01,  2.14839175e-01,
       -8.85095584e-02, -3.74324596e-01, -1.99914835e-01,  6.37827008e-01,
        7.90769174e-01, -4.52360030e-02,  1.34182909e+00, -1.00121969e+00,
       -2.10979646e+00, -2.48970256e-01, -5.93358533e-02, -1.60825779e+00,
        6.85815593e-01,  1.30677412e-01, -1.74317005e-01,  2.32504696e-01,
       -9.52615923e-01, -1.81681130e+00, -2.86331124e-01,  1.49207706e+00,
       -1.71226662e+00, -3.60431085e-01,  8.53763807e-01, -4.40515604e-01,
        1.04850712e-02, -1.66019142e+00, -2.09342045e+00,  7.38190125e-01,
        1.78581366e-01,  5.23929497e-01, -5.70862034e-01, -1.14433531e+00,
        1.78996328e+00,  1.25699790e+00,  1.29706736e+00,  6.45792010e-01,
        1.58990848e+00,  5.84903433e-01, -4.53976233e-01,  1.07902516e+00,
       -1.83706827e-01,  1.69430343e+00, -4.80319361e-01, -3.52247023e-01,
       -1.08276215e+00, -8.54043990e-01, -1.21381808e-01,  2.04381151e+00,
       -9.04903916e-02, -3.63226517e-01, -4.25966895e-01, -1.81365078e+00,
        1.07477766e+00, -2.21342260e+00, -1.09656058e+00, -1.27261154e-01,
        1.37567386e+00, -1.77469232e+00, -1.16167202e+00, -9.57405704e-02,
        1.20230504e+00, -6.93739056e-01, -8.87274554e-01,  1.04909688e+00,
        3.96835969e-01,  1.42601976e+00,  2.27475497e-01, -1.82141946e+00,
       -3.75617669e-01, -5.65280756e-01, -1.41378047e+00,  1.37649778e+00,
       -9.89769356e-01,  1.34155511e-01, -4.95724070e-01, -3.15520162e-01,
        6.79192484e-01,  1.31510174e+00,  1.79316523e-01,  6.28443122e-01,
       -1.61582575e+00,  3.69550631e-01, -4.94774592e-01, -6.46318996e-01,
        2.11521501e-01,  2.11485593e-01,  2.52884807e-01,  5.03289962e-01,
       -1.98776766e-01,  2.20391184e-01,  8.50534746e-01,  9.31115289e-01,
       -8.96890237e-02, -1.06325089e+00, -5.03444806e-02,  3.24134132e-02,
       -1.94860032e+00,  4.18592246e-01, -8.97999781e-01,  4.24903036e-01,
        4.19796134e-01, -2.47357752e+00,  5.38708972e-01, -5.61245992e-01,
        2.66287499e-01, -1.66255242e+00, -2.40930687e-01, -1.49884746e+00,
       -4.32843119e-01, -1.75882518e+00, -5.74316879e-01, -5.42510772e-01,
       -1.38493754e-02,  1.47650635e+00,  1.28960808e+00, -1.00992193e+00,
       -3.82071102e-01, -2.18108275e+00,  8.81696514e-01,  5.02645564e-02,
        1.23411457e+00,  1.24025061e-01,  1.23177059e+00,  2.60807001e-01,
        6.35702425e-01,  9.77705440e-03, -1.13393600e+00,  1.08187397e+00,
        3.12645801e-01,  3.71802591e-01, -1.75981185e+00,  4.56548977e-01,
       -9.69139619e-01, -1.55154170e+00,  2.28960499e-01, -3.69842996e-01,
       -5.37378453e-01,  2.69767434e-01,  3.65405415e-01,  1.90569432e-01,
       -8.36428997e-01,  4.60431598e-01,  7.31714421e-01, -1.22119085e-01,
       -1.84934508e-01,  4.78230588e-02,  1.86422315e-01,  8.25187159e-01,
       -1.44221246e+00,  8.58112569e-01, -1.00518243e+00, -9.25969862e-01,
        4.10204305e-01, -1.60315381e-01, -9.70275875e-01, -9.83965118e-01,
       -1.25525082e+00, -4.36110027e-01,  1.09526304e-01, -3.72104487e-02,
        1.08261914e+00, -1.28298517e-01,  7.01057444e-01, -6.74522168e-01,
       -6.69226747e-01, -9.83587667e-02,  1.64347128e+00, -6.52737659e-01,
       -4.01851467e-01,  2.03752750e+00,  3.48138067e-01,  1.70639034e+00,
        1.93759590e-01,  8.95518303e-01,  1.18256716e+00,  2.21578879e-01,
       -1.70165336e+00,  2.32427906e+00,  1.54847576e+00, -3.55551362e-01,
        6.67609899e-01, -1.20626414e+00,  2.29077843e-01,  1.05464593e+00,
        1.08350823e+00,  5.25497984e-02,  7.51144208e-01,  1.02861251e+00,
       -3.13727030e-01, -8.14409991e-01, -1.47606770e-01,  3.10140026e-01,
       -7.51398287e-02,  4.17667609e-01,  2.15451377e+00, -5.22751046e-01,
        9.48757769e-01, -6.31254264e-01,  1.14498069e-01,  2.03174335e+00,
       -6.38328204e-01,  6.25586765e-01, -1.79249328e+00,  2.37267910e+00,
       -1.05393453e+00, -3.97066023e-02,  8.13366496e-01, -5.71477020e-02,
        7.96135060e-01, -1.58499192e+00, -1.53847702e+00, -1.20289530e+00,
        1.51709769e+00,  1.85620841e-01, -1.11367867e+00,  6.72161355e-01,
        1.08164398e+00, -8.94645055e-01,  3.73153191e-01,  1.74324955e-02,
       -2.07340164e+00, -2.27260733e-01, -1.29010194e+00, -1.77287872e+00,
       -1.78616009e+00,  2.74491569e+00, -1.19240305e+00,  2.11882138e+00,
       -1.33706104e+00,  5.51546261e-02, -6.23902133e-01, -2.01422535e+00,
       -3.31025569e-01, -9.38807034e-01, -1.13526893e+00,  1.10886966e+00,
       -2.14075252e-01,  1.29949629e+00, -4.41977323e-01,  1.20960729e+00,
        1.45247084e-01, -1.83962158e+00,  5.01700675e-01, -1.81543257e-01,
        4.31660128e-01,  2.70893609e+00,  6.21896573e-01, -3.88515666e-01,
       -3.00309267e+00, -3.79234913e-02, -1.53310697e-01, -2.18764299e+00,
        5.77517646e-01, -2.98624460e-01,  1.18286728e+00,  1.08937012e-01,
        6.36343523e-01, -6.59492230e-01,  1.07523790e-02,  1.01408541e+00,
        1.19576128e+00, -7.75689737e-01,  4.38343053e-01,  6.76651285e-01,
        2.44379661e-01, -1.26685671e+00,  8.87989773e-01,  9.27475471e-01,
        1.41740220e-01,  9.29891907e-01,  2.31189599e-01, -6.28259513e-01,
       -1.48040015e+00,  3.88895335e-01,  4.10446390e-01,  1.21203658e+00,
       -2.15319450e+00, -4.68234002e-01, -1.06501525e+00, -1.34918560e+00,
        8.00890100e-01, -7.92346367e-01, -5.71644815e-01, -2.09943588e+00,
       -1.03088196e+00, -7.63484077e-01,  2.16624402e-01,  2.05828640e-01,
        4.77894544e-01, -5.57711655e-01, -5.98066822e-01,  6.48603001e-01,
        4.39699626e-01,  8.94085958e-01, -1.12072543e+00,  2.75439792e+00,
       -3.23631592e-01, -1.01369231e+00, -6.99673054e-02, -1.19682965e+00,
        2.75649576e-01, -6.78090569e-01,  2.67333001e-02, -9.59173318e-01,
        6.09577715e-01,  1.80503506e-01, -1.63567157e+00,  1.86829930e-01,
        6.60869456e-01,  9.71430505e-01,  1.15067664e+00,  1.29757058e+00,
       -1.66039743e+00,  4.77057276e-01, -4.52037368e-01,  1.45575263e+00,
        7.28064111e-01,  1.54015389e+00, -2.34280347e+00, -1.17945620e+00])

In [6]:
cats = pd.qcut(data, 4)  # 切成4份
cats

[(0.662, 3.27], (0.0398, 0.662], (0.662, 3.27], (-3.004, -0.69], (0.0398, 0.662], ..., (0.662, 3.27], (0.662, 3.27], (0.662, 3.27], (-3.004, -0.69], (-3.004, -0.69]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.004, -0.69] < (-0.69, 0.0398] < (0.0398, 0.662] < (0.662, 3.27]]

In [7]:
pd.value_counts(cats)

(-3.004, -0.69]    250
(-0.69, 0.0398]    250
(0.0398, 0.662]    250
(0.662, 3.27]      250
dtype: int64

* 與cut一樣，qcut也可以自訂每組資料量(0~1之間的數值，包含1)

In [9]:
cats2 = pd.cut(data, [0, 0.1, 0.5, 0.9, 1.])
cats2

[NaN, (0.5, 0.9], NaN, NaN, (0.1, 0.5], ..., NaN, (0.5, 0.9], NaN, NaN, NaN]
Length: 1000
Categories (4, interval[float64, right]): [(0.0, 0.1] < (0.1, 0.5] < (0.5, 0.9] < (0.9, 1.0]]

In [10]:
pd.value_counts(cats2)

(0.1, 0.5]    167
(0.5, 0.9]    123
(0.0, 0.1]     36
(0.9, 1.0]     24
dtype: int64

* <font color=yellow>離散化函式對分位數和分群分析很有用</font>

## 偵測和濾除離群值

* 陣列上運算過濾和轉換離群值(transforming outlier)

In [45]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0    0.881765  0.453094  1.064989  0.002880
1    0.360947  0.842893 -0.012153  1.099085
2   -0.869746 -0.428300 -1.084349 -0.249849
3   -1.792949  0.868327  1.124309  1.500495
4    0.807443 -1.207001 -1.740065  0.816218
..        ...       ...       ...       ...
995  1.029378  1.117399 -0.847885  0.617837
996  2.863468  2.223398  0.812480  0.791775
997  1.214432  1.500334 -2.181251  0.232210
998 -1.509985 -0.253552  0.280684 -0.366339
999  0.700847 -0.640784 -0.545277 -0.478721

[1000 rows x 4 columns]

In [46]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.033920     0.005039    -0.065612     0.008139
std       1.006420     0.977130     0.999493     0.989325
min      -3.149599    -3.768340    -3.509485    -3.480049
25%      -0.718333    -0.639726    -0.735754    -0.658675
50%       0.044885    -0.026683    -0.051145     0.022187
75%       0.662671     0.646198     0.635769     0.679859
max       2.891698     3.216040     3.271069     2.906580

* 找出指定欄位中，絕對值大於3的值

In [47]:
col = data[2]
col

0      1.064989
1     -0.012153
2     -1.084349
3      1.124309
4     -1.740065
         ...
995   -0.847885
996    0.812480
997   -2.181251
998    0.280684
999   -0.545277
Name: 2, Length: 1000, dtype: float64

In [48]:
col[np.abs(col) > 3]

471   -3.509485
600   -3.481369
690    3.271069
737    3.025800
Name: 2, dtype: float64

* 在全部欄中，選擇值超過 3 或 -3 的列的話，可以呼叫布林DataFrame的any方法

In [49]:
data[(np.abs(data) > 3).any(axis=1)]

            0         1         2         3
157 -1.212701  0.269279  0.520109 -3.480049
238 -3.149599 -1.671241 -0.928934  0.227863
471  0.432228  1.545776 -3.509485  1.131292
508  0.720314  3.216040 -1.167339  0.215136
600  1.065337  1.882669 -3.481369  0.250314
690 -0.718443  1.582160  3.271069  1.068597
737  0.794120  0.622819  3.025800 -0.992503
911 -0.193864 -3.768340 -0.325176 -0.320907

In [50]:
# test = np.abs(data) > 3
# test -> 可得出布林陣列mask
data[(np.abs(data) > 3).any(axis=1)]

            0         1         2         3
157 -1.212701  0.269279  0.520109 -3.480049
238 -3.149599 -1.671241 -0.928934  0.227863
471  0.432228  1.545776 -3.509485  1.131292
508  0.720314  3.216040 -1.167339  0.215136
600  1.065337  1.882669 -3.481369  0.250314
690 -0.718443  1.582160  3.271069  1.068597
737  0.794120  0.622819  3.025800 -0.992503
911 -0.193864 -3.768340 -0.325176 -0.320907

* 這些條件也可以拿來當作給值的部分
* 嘗試把值保持在3 ~ -3之間

In [51]:
data[(np.abs(data)) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.033771     0.005591    -0.064918     0.008619
std       1.005967     0.973770     0.995377     0.987746
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.718333    -0.639726    -0.735754    -0.658675
50%       0.044885    -0.026683    -0.051145     0.022187
75%       0.662671     0.646198     0.635769     0.679859
max       2.891698     3.000000     3.000000     2.906580

* np.sign(data)會視data中的值是正數或是負數，產生 1 或 -1

In [52]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0  1.0 -1.0  1.0
2 -1.0 -1.0 -1.0 -1.0
3 -1.0  1.0  1.0  1.0
4  1.0 -1.0 -1.0  1.0

In [63]:
mask = np.abs(data) > 3
mask

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

## 排列與隨機取樣

* 若要對Series或DataFrame中的列作隨機排列(隨機重新排序)，只要使用numpy.random.permutation函式即可
* 呼叫permutation時，指定你想排列的軸的長度，即可得到內還新的次序的陣列

In [2]:
df = pd.DataFrame(np.arange(5 * 4).reshape(5, 4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [3]:
sampler = np.random.permutation(5)
sampler

array([2, 4, 1, 0, 3])

* sampler可以用於iloc為基礎的索引，或等效的take函式裡

In [4]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [5]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

* 若要隨機選擇不重複子集的話，就使用Series或DataFrame的sample方法

In [6]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7

* 若要隨機選擇可重複子集的話，就在sample方法中指定replace=True

In [7]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [8]:
draws = choices.sample(n=10, replace=True)
draws

4    4
1    7
3    6
1    7
1    7
0    5
1    7
1    7
0    5
1    7
dtype: int64

## 指標/虛擬變數

* 將一個類別變數，轉換為"虛擬(dummy)"或"指標(indicator)"陣列

* 假設DataFrame中的某一欄裡有k個相異值，可以創造出一個擁有k欄，內容為1或0的矩陣或DataFrame
* * pandas中有一個get_dummies函式可以達成上述要求

In [2]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [4]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

* 可以為DataFrame的欄位加上前綴，這個動作可以直接在get_dummies中完成

In [5]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [7]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

* 如果dataFrame中的一列同時屬於多個類別，則會較複雜

In [3]:
movie_names = ['movie_id', 'title', 'genres']
movie_names

['movie_id', 'title', 'genres']

In [8]:
path = r'D:\Python\Python 資料分析\範例資料集\datasets\movielens\movies.dat'
movies = pd.read_table(path, sep='::', header=None, names=movie_names, encoding='unicode_escape')
movies.head()

D:\conda\lib\site-packages\pandas\util\_decorators.py:311: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return func(*args, **kwargs)

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

* 為每一種電影做分類(genre)

In [9]:
all_genres = []

for x in movies.genres:
    all_genres.extend(x.split('|'))

all_genres

['Animation',
 "Children's",
 'Comedy',
 'Adventure',
 "Children's",
 'Fantasy',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Comedy',
 'Action',
 'Crime',
 'Thriller',
 'Comedy',
 'Romance',
 'Adventure',
 "Children's",
 'Action',
 'Action',
 'Adventure',
 'Thriller',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Horror',
 'Animation',
 "Children's",
 'Drama',
 'Action',
 'Adventure',
 'Romance',
 'Drama',
 'Thriller',
 'Drama',
 'Romance',
 'Thriller',
 'Comedy',
 'Action',
 'Action',
 'Comedy',
 'Drama',
 'Crime',
 'Drama',
 'Thriller',
 'Thriller',
 'Drama',
 'Sci-Fi',
 'Drama',
 'Romance',
 'Drama',
 'Drama',
 'Romance',
 'Adventure',
 'Sci-Fi',
 'Drama',
 'Drama',
 'Drama',
 'Sci-Fi',
 'Adventure',
 'Romance',
 "Children's",
 'Comedy',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Documentary',
 'Comedy',
 'Comedy',
 'Romance',
 'Drama',
 'Drama',
 'War',
 'Action',
 'Crime',
 'Drama',
 'Drama',
 'Action',
 'Adventure',
 'Comedy',
 'Drama',
 'Drama',
 'Romance',
 'Crime',
 'Thriller',
 'Animation',
 "Children's",
 'Musical',
 'Romance',
 'Drama',
 'Romance',
 'Crime',
 'Thriller',
 'Action',
 'Drama',
 'Thriller',
 'Comedy',
 'Drama',
 "Children's",
 'Comedy',
 'Drama',
 'Adventure',
 "Children's",
 'Fantasy',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Mystery',
 'Adventure',
 "Children's",
 'Fantasy',
 'Drama',
 'Thriller',
 'Drama',
 'Comedy',
 'Comedy',
 'Romance',
 'Comedy',
 'Sci-Fi',
 'Thriller',
 'Drama',
 'Comedy',
 'Romance',
 'Comedy',
 'Action',
 'Comedy',
 'Crime',
 'Horror',
 'Thriller',
 'Action',
 'Comedy',
 'Drama',
 'Drama',
 'Musical',
 'Drama',
 'Romance',
 'Comedy',
 'Drama',
 'Sci-Fi',
 'Thriller',
 'Documentary',
 'Drama',
 'Drama',
 'Thriller',
 'Drama',
 'Crime',
 'Drama',
 'Romance',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Romance',
 'Adventure',
 'Drama',
 "Children's",
 'Comedy',
 'Comedy',
 'Action',
 'Thriller',
 'Drama',
 'Drama',
 'Thriller',
 'Comedy',
 'Romance',
 'Drama',
 'Action',
 'Thriller',
 'Comedy',
 'Drama',
 'Action',
 'Thriller',
 'Documentary',
 'Drama',
 'Thriller',
 'Comedy',
 'Comedy',
 'Thriller',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Drama',
 'Adventure',
 "Children's",
 'Comedy',
 'Musical',
 'Documentary',
 'Comedy',
 'Action',
 'Drama',
 'War',
 'Drama',
 'Thriller',
 'Action',
 'Adventure',
 'Crime',
 'Drama',
 'Mystery',
 'Drama',
 'Comedy',
 'Documentary',
 'Crime',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Romance',
 'Drama',
 'Mystery',
 'Romance',
 'Drama',
 'Comedy',
 'Adventure',
 "Children's",
 'Fantasy',
 'Drama',
 'Documentary',
 'Comedy',
 'Romance',
 'Drama',
 'Drama',
 'Romance',
 'Thriller',
 'Comedy',
 'Drama',
 'Documentary',
 'Comedy',
 'Documentary',
 'Documentary',
 'Drama',
 'Action',
 'Drama',
 'Drama',
 'Romance',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Action',
 'Adventure',
 "Children's",
 'Drama',
 'Drama',
 'Crime',
 'Drama',
 'Thriller',
 'Drama',
 'Drama',
 'Romance',
 'War',
 'Horror',
 'Action',
 'Adventure',
 'Comedy',
 'Crime',
 'Drama',
 'Drama',
 'War',
 'Comedy',
 'Comedy',
 'War',
 'Adventure',
 "Children's",
 'Drama',
 'Action',
 'Adventure',
 'Mystery',
 'Sci-Fi',
 'Drama',
 'Thriller',
 'War',
 'Documentary',
 'Action',
 'Romance',
 'Thriller',
 'Crime',
 'Film-Noir',
 'Mystery',
 'Thriller',
 'Action',
 'Thriller',
 'Comedy',
 'Drama',
 'Drama',
 'Action',
 'Adventure',
 'Drama',
 'Romance',
 'Adventure',
 "Children's",
 'Drama',
 'Action',
 'Crime',
 'Thriller',
 'Comedy',
 'Action',
 'Sci-Fi',
 'Thriller',
 'Action',
 'Adventure',
 'Sci-Fi',
 'Comedy',
 'Drama',
 'Comedy',
 'Horror',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Action',
 "Children's",
 'Drama',
 'Romance',
 'Thriller',
 'Drama',
 'Sci-Fi',
 'Thriller',
 'Comedy',
 'Comedy',
 'Horror',
 'Comedy',
 'Thriller',
 'Drama',
 'Documentary',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 'Romance',
 'Horror',
 'Sci-Fi',
 'Drama',
 'Action',
 'Crime',
 'Sci-Fi',
 'Drama',
 'Musical',
 'Thriller',
 'Drama',
 'Drama',
 'Romance',
 'Comedy',
 'Action',
 'Comedy',
 'Drama',
 'Documentary',
 'Drama',
 'Romance',
 'Action',
 'Adventure',
 'Drama',
 'Western',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Comedy',
 'Drama',
 'Thriller',
 'Comedy',
 'Drama',
 'Drama',
 'Horror',
 'Drama',
 'Romance',
 'Comedy',
 'Comedy',
 'Drama',
 'Romance',
 'Drama',
 'Thriller',
 'Thriller',
 'Action',
 'Comedy',
 'Drama',
 'Thriller',
 'Drama',
 'Thriller',
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Comedy',
 'Romance',
 'Comedy',
 'Romance',
 'Adventure',
 "Children's",
 'Animation',
 "Children's",
 'Comedy',
 'Romance',
 'Thriller',
 "Children's",
 'Drama',
 'Drama',
 'Musical',
 'Comedy',
 'Animation',
 "Children's",
 'Crime',
 'Drama',
 'Documentary',
 'Drama',
 'Fantasy',
 'Romance',
 'Thriller',
 'Comedy',
 'Drama',
 'Romance',
 "Children's",
 'Comedy',
 'Action',
 'Comedy',
 'Romance',
 'Drama',
 'Horror',
 'Drama',
 'Comedy',
 'Comedy',
 'Sci-Fi',
 'Mystery',
 'Thriller',
 'Adventure',
 "Children's",
 'Comedy',
 'Fantasy',
 'Romance',
 'Crime',
 'Drama',
 'Thriller',
 'Action',
 'Adventure',
 'Fantasy',
 'Sci-Fi',
 'Drama',
 "Children's",
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Romance',
 'War',
 'Western',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Drama',
 'Drama',
 'Horror',
 'Comedy',
 'Comedy',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Thriller',
 'Drama',
 'Drama',
 'Crime',
 'Drama',
 'Action',
 'Crime',
 'Drama',
 'Horror',
 'Action',
 'Sci-Fi',
 'Thriller',
 'Comedy',
 'Romance',
 'Action',
 'Thriller',
 'Comedy',
 'Romance',
 'Crime',
 'Drama',
 'Thriller',
 'Action',
 'Drama',
 'Thriller',
 'Crime',
 'Drama',
 'Romance',
 'Thriller',
 'Comedy',
 'Romance',
 'Comedy',
 'Romance',
 'Crime',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Romance',
 'Action',
 'Adventure',
 'Western',
 'Comedy',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Comedy',
 'Horror',
 'Thriller',
 'Comedy',
 'Animation',
 "Children's",
 'Drama',
 'Action',
 'Action',
 'Adventure',
 'Sci-Fi',
 "Children's",
 'Comedy',
 'Fantasy',
 'Drama',
 'Thriller',
 'Film-Noir',
 'Thriller',
 'Drama',
 'Comedy',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Action',
 'Comedy',
 'Musical',
 'Sci-Fi',
 'Horror',
 'Action',
 'Adventure',
 'Sci-Fi',
 'Comedy',
 'Horror',
 'Drama',
 'Horror',
 'Sci-Fi',
 'Comedy',
 'Drama',
 'Mystery',
 'Thriller',
 'Drama',
 'War',
 'Drama',
 'Sci-Fi',
 'Thriller',
 'Comedy',
 'Romance',
 'Adventure',
 'Drama',
 'Drama',
 'Comedy',
 'Romance',
 "Children's",
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Musical',
 'Drama',
 'Comedy',
 'Action',
 'Adventure',
 'Thriller',
 'Drama',
 'Mystery',
 'Thriller',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Action',
 'Romance',
 'Thriller',
 'Drama',
 "Children's",
 'Comedy',
 'Comedy',
 'Romance',
 'War',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Drama',
 'Romance',
 'Action',
 'Comedy',
 'Drama',
 'Romance',
 'Adventure',
 "Children's",
 'Romance',
 'Documentary',
 'Animation',
 "Children's",
 'Musical',
 'Drama',
 'Horror',
 'Comedy',
 'Crime',
 'Fantasy',
 'Action',
 'Comedy',
 'Western',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Comedy',
 'Drama',
 'Thriller',
 "Children's",
 'Comedy',
 'Drama',
 'Action',
 'Thriller',
 'Action',
 'Romance',
 'Thriller',
 'Comedy',
 'Romance',
 'Action',
 'Sci-Fi',
 'Action',
 'Adventure',
 'Comedy',
 'Romance',
 'Drama',
 'Drama',
 'Horror',
 'Western',
 'Action',
 'Drama',
 'Drama',
 'Action',
 'Comedy',
 'Drama',
 'Drama',
 'Romance',
 'War',
 'Action',
 'Comedy',
 'Drama',
 'Crime',
 'Drama',
 'Adventure',
 "Children's",
 'Action',
 'Action',
 'Drama',
 'Drama',
 'Horror',
 'Documentary',
 'Drama',
 'Drama',
 'Action',
 'Thriller',
 'Comedy',
 'Comedy',
 'Crime',
 'Drama',
 'Documentary',
 'Action',
 'Sci-Fi',
 'Drama',
 'Horror',
 'Thriller',
 'Drama',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Comedy',
 'Comedy',
 'Comedy',
 'Thriller',
 'Western',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Action',
 'Comedy',
 'Adventure',
 "Children's",
 'Thriller',
 'Action',
 'Thriller',
 'Drama',
 'Drama',
 'Romance',
 'Horror',
 'Sci-Fi',
 'Thriller',
 'Mystery',
 'Romance',
 'Thriller',
 'Drama',
 'Comedy',
 'Drama',
 'Crime',
 'Drama',
 'Comedy',
 'Western',
 'Comedy',
 'Action',
 'Adventure',
 'Crime',
 'Comedy',
 'Sci-Fi',
 'Drama',
 'Thriller',
 'Comedy',
 'Action',
 'Comedy',
 'Drama',
 'Comedy',
 'Romance',
 'Comedy',
 'Action',
 'Sci-Fi',
 'Documentary',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Mystery',
 'Romance',
 'Drama',
 'Comedy',
 'Drama',
 'Thriller',
 'Adventure',
 "Children's",
 'Drama',
 'Drama',
 'Action',
 'Thriller',
 'Drama',
 'Western',
 'Action',
 'Comedy',
 'Drama',
 'Romance',
 'Action',
 'Adventure',
 'Crime',
 'Drama',
 'Thriller',
 'Action',
 'Adventure',
 'Crime',
 'Thriller',
 'Action',
 'Drama',
 'War',
 'Action',
 'Comedy',
 'War',
 'Comedy',
 'Comedy',
 'Romance',
 'Drama',
 'Romance',
 'Comedy',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Comedy',
 'War',
 'Action',
 'Thriller',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Action',
 'Action',
 'Adventure',
 'Sci-Fi',
 'Drama',
 'Thriller',
 'Thriller',
 'Drama',
 'Adventure',
 "Children's",
 'Action',
 'Comedy',
 'Comedy',
 'Comedy',
 'Western',
 'Drama',
 'Comedy',
 'Thriller',
 'Drama',
 'Comedy',
 'Mystery',
 'Action',
 'Crime',
 'Drama',
 'Action',
 'Thriller',
 'Drama',
 'Comedy',
 'Drama',
 'Romance',
 'Comedy',
 'Romance',
 'Drama',
 'Romance',
 'Comedy',
 'Romance',
 'Comedy',
 'Drama',
 'Action',
 "Children's",
 'Drama',
 'Action',
 'Sci-Fi',
 'Comedy',
 'Drama',
 'Action',
 'Drama',
 'Drama',
 'Drama',
 'Romance',
 'Drama',
 'Action',
 'Drama',
 'Horror',
 'Sci-Fi',
 'Comedy',
 'Mystery',
 'Romance',
 'Comedy',
 'Drama',
 'Comedy',
 'Drama',
 'War',
 'Action',
 'Drama',
 'Mystery',
 'Comedy',
 'Sci-Fi',
 'Thriller',
 'Comedy',
 'Crime',
 'Thriller',
 'Action',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'War',
 'Drama',
 'Drama',
 'Drama',
 "Children's",
 'Drama',
 'Comedy',
 'Crime',
 'Horror',
 'Action',
 'Drama',
 'Romance',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Romance',
 'Thriller',
 'Film-Noir',
 'Sci-Fi',
 'Comedy',
 'Comedy',
 'Romance',
 'Thriller',
 'Action',
 'Drama',
 'Action',
 'Adventure',
 "Children's",
 'Sci-Fi',
 'Action',
 'Adventure',
 'Thriller',
 'Action',
 'Documentary',
 'Comedy',
 'Romance',
 "Children's",
 'Comedy',
 'Musical',
 'Action',
 'Adventure',
 'Comedy',
 'Western',
 'Thriller',
 'Action',
 'Crime',
 'Romance',
 'Documentary',
 'Drama',
 'Action',
 'Adventure',
 'Animation',
 "Children's",
 'Fantasy',
 'Comedy',
 'Drama',
 'Thriller',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 'Horror',
 'Comedy',
 'Romance',
 'Drama',
 'Comedy',
 'Drama',
 "Children's",
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Drama',
 'Drama',
 'Comedy',
 'Drama',
 "Children's",
 'Comedy',
 'Comedy',
 'Adventure',
 "Children's",
 'Drama',
 'Mystery',
 'Thriller',
 'Drama',
 'Documentary',
 'Comedy',
 'Comedy',
 'Drama',
 'Drama',
 'Comedy',
 "Children's",
 'Comedy',
 'Comedy',
 'Romance',
 'Thriller',
 'Animation',
 "Children's",
 'Comedy',
 'Musical',
 'Action',
 'Sci-Fi',
 'Thriller',
 'Adventure',
 ...]

In [11]:
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

* 一種建構指標DataFrame的方法是從填充0的DataFrame開始

In [18]:
zero_matrix = np.zeros((len(movies), len(genres)))
zero_matrix

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [19]:
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

* 接下來從頭疊代過每一部電影，並在電影出現的dummies的列標記上1(在對應的分類上)
* 要做到這一點，需先得到分類的index -> 可使用dummies.columns來計算欄位的index

In [25]:
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [26]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

* 接下來使用.iloc配合上述的index便可設定值了

In [28]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1  # iloc[row, column]

* 最後再把結果與movies合併

In [31]:
movie_windic = movies.join(dummies.add_prefix('Genre_'))
movie_windic.head()

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [35]:
movie_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

* 如果是處理巨型資料的話，這個建構多項目指標變數的方法速度就會變慢 -> 可以直接寫到Numpy陣列的低階函式，再轉回一個DataFrame

* 如果是做統計應用，一個好用的用途是將get_dummies和離散函式(像cut這種)結合起來應用

* 使用numpy.random.seed設定隨機種子 -> 固定住範例中的隨機值

In [36]:
np.random.seed(12345)

In [37]:
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [38]:
bins = [0., 0.2, 0.4, 0.6, 0.8, 1]
bins

[0.0, 0.2, 0.4, 0.6, 0.8, 1]

In [39]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0